{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "batted_ball_model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 253, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "batted_ball_Input"}, "name": "batted_ball_Input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "batted_ball_GRU1", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}, "registered_name": null}, "merge_mode": "concat"}, "name": "batted_ball_GRU1", "inbound_nodes": [[["batted_ball_Input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "situation_Input"}, "name": "situation_Input", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "batted_ball_Dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "batted_ball_Dropout", "inbound_nodes": [[["batted_ball_GRU1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "situation_Dense2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "situation_Dense2", "inbound_nodes": [[["situation_Input", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "batted_ball_situation_Concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "batted_ball_situation_Concatenate", "inbound_nodes": [[["batted_ball_Dropout", 0, 0, {}], ["situation_Dense2", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "player_ID_Input"}, "name": "player_ID_Input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "position_Input"}, "name": "position_Input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "batted_ball_situation_Dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "batted_ball_situation_Dense", "inbound_nodes": [[["batted_ball_situation_Concatenate", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "player_key_Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 999, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "player_key_Embedding", "inbound_nodes": [[["player_ID_Input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "position_Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 10, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "position_Embedding", "inbound_nodes": [[["position_Input", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "batted_ball_Reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 32]}, "name": "batted_ball_Reshape", "inbound_nodes": [[["batted_ball_situation_Dense", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "player_and_position_Add", "trainable": true, "dtype": "float32"}, "name": "player_and_position_Add", "inbound_nodes": [[["player_key_Embedding", 0, 0, {}], ["position_Embedding", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "attention_query_key", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "attention_query_key", "inbound_nodes": [[["batted_ball_Reshape", 0, 0, {}], ["player_and_position_Add", 0, 0, {}]]]}, {"class_name": "Rescaling", "config": {"name": "attention_rescaping", "trainable": true, "dtype": "float32", "scale": 0.3333333333333333, "offset": 0.0}, "name": "attention_rescaping", "inbound_nodes": [[["attention_query_key", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "attention_softmax", "trainable": true, "dtype": "float32", "axis": -1}, "name": "attention_softmax", "inbound_nodes": [[["attention_rescaping", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "player_value_Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 999, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "player_value_Embedding", "inbound_nodes": [[["player_ID_Input", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "attention_weight_value", "trainable": true, "dtype": "float32", "axes": [2, 1], "normalize": false}, "name": "attention_weight_value", "inbound_nodes": [[["attention_softmax", 0, 0, {}], ["player_value_Embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "lineup_Flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "lineup_Flatten", "inbound_nodes": [[["attention_weight_value", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lineup_Dense1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lineup_Dense1", "inbound_nodes": [[["lineup_Flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lineup_Dropout1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "lineup_Dropout1", "inbound_nodes": [[["lineup_Dense1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "batted_ball_Dense2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "batted_ball_Dense2", "inbound_nodes": [[["batted_ball_Dropout", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "lineup_Concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "lineup_Concatenate", "inbound_nodes": [[["lineup_Dropout1", 0, 0, {}], ["situation_Dense2", 0, 0, {}], ["batted_ball_Dense2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lineup_Dropout2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "lineup_Dropout2", "inbound_nodes": [[["lineup_Concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lineup_Dense3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lineup_Dense3", "inbound_nodes": [[["lineup_Dropout2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lineup_Dropout3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "lineup_Dropout3", "inbound_nodes": [[["lineup_Dense3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lineup_Dense4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lineup_Dense4", "inbound_nodes": [[["lineup_Dropout3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_Dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_Dense", "inbound_nodes": [[["lineup_Dense4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "output_LeakeyRelu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "output_LeakeyRelu", "inbound_nodes": [[["output_Dense", 0, 0, {}]]]}], "input_layers": [["batted_ball_Input", 0, 0], ["situation_Input", 0, 0], ["player_ID_Input", 0, 0], ["position_Input", 0, 0]], "output_layers": [["output_LeakeyRelu", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-05, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batted_ball_Dense2/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "batted_ball_Dense2/bias", "shape": [32], "dtype": "float32"}, {"name": "batted_ball_GRU1/forward_gru_2/gru_cell/kernel", "shape": [3, 192], "dtype": "float32"}, {"name": "batted_ball_GRU1/forward_gru_2/gru_cell/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "batted_ball_GRU1/forward_gru_2/gru_cell/bias", "shape": [192], "dtype": "float32"}, {"name": "batted_ball_GRU1/backward_gru_2/gru_cell/kernel", "shape": [3, 192], "dtype": "float32"}, {"name": "batted_ball_GRU1/backward_gru_2/gru_cell/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "batted_ball_GRU1/backward_gru_2/gru_cell/bias", "shape": [192], "dtype": "float32"}, {"name": "batted_ball_situation_Dense/kernel", "shape": [160, 32], "dtype": "float32"}, {"name": "batted_ball_situation_Dense/bias", "shape": [32], "dtype": "float32"}, {"name": "lineup_Dense1/kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "lineup_Dense1/bias", "shape": [128], "dtype": "float32"}, {"name": "lineup_Dense3/kernel", "shape": [192, 64], "dtype": "float32"}, {"name": "lineup_Dense3/bias", "shape": [64], "dtype": "float32"}, {"name": "lineup_Dense4/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "lineup_Dense4/bias", "shape": [32], "dtype": "float32"}, {"name": "output_Dense/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "output_Dense/bias", "shape": [1], "dtype": "float32"}, {"name": "player_key_Embedding/embeddings", "shape": [999, 32], "dtype": "float32"}, {"name": "player_value_Embedding/embeddings", "shape": [999, 32], "dtype": "float32"}, {"name": "position_Embedding/embeddings", "shape": [10, 32], "dtype": "float32"}, {"name": "situation_Dense2/kernel", "shape": [4, 32], "dtype": "float32"}, {"name": "situation_Dense2/bias", "shape": [32], "dtype": "float32"}]}]}